[
  {
    "review_title": "A hidden gem",
    "score": "5",
    "review_text": "A beautiful house with heaps of period charm and spectacular views across the bay. Peaceful and comfortable in the manner of a more genteel era, perfectly completed by the warm welcome and attention to detail of our hosts Kate and Helen... for our group of 10 guests it was unanimous that we shall return, a faultless stay.",
    "review_date": "12th June, 2024",
    "review_author": "Richard"
  },

  {
    "review_title": "Wonderful",
    "score": "5",
    "review_text": "Nice stay at a beautiful place. Very clean and good breakfast. Enjoyed our stay very much.",
    "review_date": "7th June, 2024",
    "review_author": "Liesbeth T"
  },

  {
    "review_title": "A very enjoyable stay",
    "score": "5",
    "review_text": "We had a very enjoyable stay. Lovely views from our room. The area was very quiet and peaceful We enjoyed the breakfast and the owners were very hospitable.",
    "review_date": "7th June, 2024",
    "review_author": "Deborah C"
  },

  {
    "review_title": "Very comfortable stay",
    "score": "5",
    "review_text": "Everything excellent. For us personally we would have liked an earlier breakfast time, but we couldn’t fault any aspect of the stay.",
    "review_date": "7th June, 2024",
    "review_author": "Barnes"
  },

  {
    "review_title": "Delightful",
    "score": "5",
    "review_text": "My 2nd stay at this lovely hotel.Currently being managed by the 2nd.. generation of the Hodges family. The hotel oozes charm ,is beautifully appointed ,and sits in a gloriously elevated position with amazing views across to Wales and down to Lynmouth.Breakfasts are every bit as good as my last visit and the bedrooms and public rooms are comfortable and spotlessly clean. I will not hesitate to book again when next visiting Devon.",
    "review_date": "4th June, 2024",
    "review_author": "Derek K"
  },

  {
    "review_title": "A Superb Stay",
    "score": "5",
    "review_text": "The Chough's Nest is truly a special place, perfectly located on the North Walk, with access to lovely walking paths just outside the door. The building is nestled in a bower of flowers, and it was a joy to watch scores of birds enjoying the bird feeders outside the breakfast room window. The hotel is family run, and two of the daughters, raised since childhood in the hotel business, have recently taken it over. They are excellent cooks and bakers (wonderful homemade scones!) and offer delicious dinner options five nights a week, which we took advantage of for all four nights of our stay. Their butternut squash risotto and chocolate pudding cake were deliciously memorable, along with everything else we sampled. After a long walking day, it was lovely to return to the hotel to a wonderful meal waiting for us, rather than searching out restaurants in the crowded towns. Thank you, Kate and Helen, for your spectacular hospitality. ",
    "review_date": "4th June, 2024",
    "review_author": "Kathy L"
  },

  {
    "review_title": "Great stay",
    "score": "5",
    "review_text": "We had a wonderful stay, with lovely room, great breakfast and very obliging staff. See you later in the year.",
    "review_date": "27th May, 2024",
    "review_author": "Rachel C"
  },

  {
    "review_title": "Exceptional ",
    "score": "5",
    "review_text": "Well what can I say about this Hotel. I was a little daunted when we turned onto the single track road leading to the Choughs Nest Hotel. But the reception we received was just lovely warm and friendly,after which we were shown to our room witch was full of light, spacious and spotlessly clean.Although they do not serve evening dinner they did offer us a cold menu, the food was all made in their own kitchen by a member of the family it was fantastic. After a good night's sleep we enjoyed a hearty breakfast. This is a not to be missed Hotel if your in this area. Thank you all for a lovely few days.",
    "review_date": "25th May, 2024",
    "review_author": "Vera B"
  },

  {
    "review_title": "A welcome break for my wife's birthday in a very caring hotel.",
    "score": "5",
    "review_text": "From the time we arrived we were made very welcome. Our room was excellent with first class facilities and a glorious view. Breakfast and the light evening meals were delicious and the offer of cakes and fruit to take away (even a bag was supplied) was a first for us and much appreciated. Being able to walk straight onto the valley of the rocks was an added bonus.",
    "review_date": "25th May, 2024",
    "review_author": "Rod T"
  },

  {
    "review_title": "Very welcoming and very comfortable.",
    "score": "5",
    "review_text": "We thoroughly enjoyed our short stay at Choughs Nest. The owner and his family were very friendly and welcoming. The room was a good size, clean and well appointed and had a magnificent view over the sea to Wales. It is only a short walk to the centre of Lynton and is on the coastal path to the Valley of the Rocks. But the best part of the stay was the excellent breakfasts, perfectly cooked and served with a smile. Thoughtfully, the toast was served after the cooked course and therefore still warm when we wanted to eat it. We'll visit again.",
    "review_date": "23rd May, 2024",
    "review_author": "William C"
  },

  {
    "review_title": "Lovely",
    "score": "5",
    "review_text": "We have always liked this path to the Valley of the Rocks, & staying at The Chough's Nest was everything we had hoped for. Wonderful views, excellent food & service. Very quiet, & yet easy access to shops cafes,& buses, & short drive to all kinds of lovely places. We will most certainly be back.",
    "review_date": "22nd May, 2024",
    "review_author": "Mrs M"
  },

  {
    "review_title": "An excellent stay",
    "score": "5",
    "review_text": "A lovely few days recapturing memories of our honeymoon at The Chough’s Nest in October 1976. We had a very comfortable, spacious room with sea view and we couldn’t have been looked after any better by Kate and Helen who served an excellent breakfast (including black pudding by special request! thanks Kate) and home made light evening meals. The homemade cakes put out at breakfast which were free to take away were much appreciated, especially the Rock Cakes. Thanks for a lovely stay. ",
    "review_date": "22nd May, 2024",
    "review_author": "Sue J"
  },

  {
    "review_title": "Fabulous Stay",
    "score": "5",
    "review_text": "We used to stay at this Hotel 25 years ago so decided to relive some old memories. Very pleased we returned. The girls made us feel really welcome and our room (2) was excellent; spacious, clean, comfy and a with a superb view. Breakfast was very good and we had an evening meal that was beautifully cooked and generous. We are more than happy to recommend Choughs Nest.",
    "review_date": "22nd May, 2024",
    "review_author": "Steve R"
  },

  {
    "review_title": "Another wonderful stay at the Choughs Nest ",
    "score": "5",
    "review_text": "My wife and I have stayed here on many occasions and hope for many more. The hotel is friendly but professionally managed. The rooms are beautiful with magnificent views with a fantastic breakfast which will set you up for the day. The hotel is well placed for walks into the Valley of the rocks and other local beauty spots including Lynmouth. All in all couldn't be better. ",
    "review_date": "21st May, 2024",
    "review_author": "Peter W"
  },

  {
    "review_title": "Well run small hotel with a fantastic view.",
    "score": "5",
    "review_text": "We stayed at the hotel for four nights in May 2024. The owner/staff were very friendly and helpful. We had a good sized room, which was clean and well appointed and had a great view of the Bristol Channel. The breakfasts were of excellent quality and cooked perfectly. Overall we were extremely happy with our stay and would recommend the hotel.",
    "review_date": " 16th May, 2024",
    "review_author": "James G"
  },

  {
    "review_title": "Wonderful Stay at Chough's Nest",
    "score": "5",
    "review_text": "We have stayed at Chough's Nest many times, it was wonderful as always. The welcome was warm and friendly, the views from the room were excellent, the location was great. We enjoyed being able to leave the hotel, turn left and walk straight onto the coastal path to Valley of the Rocks, and be able to so easily access the whole of Lynton and Lynmouth. ",
    "review_date": "13th May, 2024",
    "review_author": "Bridget S"
  },

  {
    "review_title": "Fabulous",
    "score": "4",
    "review_text": "A well run friendly family hotel in a perfect location.",
    "review_date": "10th May, 2024",
    "review_author": "Sue"
  },

  {
    "review_title": "Another great stay.",
    "score": "5",
    "review_text": "I understand the daughters of John and Rosemary are running the hotel with excellent parental input. We had 5 days of a perfect break, with our room being clean and fresh and having the amazing view of the sea, like all rooms do. The breakfasts were superb and you had all you wanted for the start of the day. We have stayed before and I am positive that we shall be staying again.",
    "review_date": "6th May, 2024",
    "review_author": "Paul B"
  },

  {
    "review_title": "Excellent and a wonderful place to stay in Lynton with amazing views",
    "score": "4",
    "review_text": "Beautiful place to stay with amazing view from our window Bedrooms lovely very comfy kingsize bed, tastefully decorated And always looked after every day, with fresh towels and tea and coffee. Breakfast is served at your table, and the menu is excellent, With a choice of cereals, fresh fruit, yogurt and toast, and full English breakfast, or poached eggs, scrambled eggs, and they cater for vegetarian as well. The staff are very helpfull, if needed, and we would certainley recommend. ",
    "review_date": "6th May, 2024",
    "review_author": " Mrs K"
  },

  {
    "review_title": "Splendid",
    "score": "5",
    "review_text": "Friendly, family-run hotel. Really nice room, clean and comfortable with plenty of space and a lovely view. Good breakfasts.",
    "review_date": "6th May, 2024",
    "review_author": "Trevor H"
  },

  {
    "review_title": "Fantastic Ruby wedding anniversary ",
    "score": "5",
    "review_text": "It was lovely to go back to the Choughs nest, where we had our honeymoon, and it did not disappoint in anyway, our room, The Nest, was spacious, clean and comfortable and it was made up every day, the bathroom was large and very clean, we loved the sea views and the spectacular sunrises. For breakfast there was a very good choice and all cooked beautifully and well presented, we had a light bite meal on the evening of our anniversary which was superb very special and the bakes that were available for us to take out for the day was a lovely touch. Thank you so much Kate and Helen for making our stay with you magical. Definitely hope to come back to this very special hotel.",
    "review_date": "4th May, 2024",
    "review_author": "Colin S"
  }
]
